opposedJet1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     plicBinTransFlowFoam; //
calcDropC10;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

//deltaT          5e-6;
deltaT          0.005;  // For post-processing

writeControl    adjustableRunTime;
//writeControl    timeStep;

writeInterval   0.005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;
maxDiffCo       0.5;

maxDeltaT       0.01;

// For post-processing
dx              4e-6;
dy              4e-6;
dz              0.001;
tSteady1        0.079;
tSteady2        0.081;

// ************************************************************************* //
