opposedJet1/system/controlDict_Plic2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     plicAdvDiffIstFlowFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.15;

deltaT          2.5e-6;

writeControl    adjustableRunTime;
//writeControl    timeStep;

writeInterval   0.005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.25;
maxAlphaCo      0.25;
maxDiffCo       0.25;

maxDeltaT       0.05;

dz              0.0001;

// ************************************************************************* //
