opposedJet1/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1  0
    //    volScalarFieldValue Y00     0 
    //    volScalarFieldValue Y10     1
    volScalarFieldValue T1      700
);

regions
(    
    sphereToCell
    {
        centre (0.0005 0.0005 -0.0005);
	radius 0.000125;
        fieldValues
        (
            volScalarFieldValue alpha1  1
            //            volScalarFieldValue Y00     0
            //            volScalarFieldValue Y10     1
            volScalarFieldValue T1      705
        );
    }    
);


// ************************************************************************* //
